assignment1/scripts/client/closed_load/run2/Client_30/logs/20180128-1843/tsung30.xml
<?xml version="1.0"?><tsung loglevel="info">
	<clients>
		<client host="localhost" maxusers="15000" use_controller_vm="true"/>
	</clients>

	<servers>
		<server host="bernoulli" port="80" type="tcp"/>
	</servers>

	<load duration="3" unit="minute">
		<arrivalphase phase="1" duration="3" unit="minute">
			<users maxnumber="30" arrivalrate="30" unit="second"/>
		</arrivalphase>
	</load>

	<options>
		<option name="thinktime" value="2" random="true" override="true"/>
		<option name="connect_timeout" value="50000"/>
	</options>

	<sessions>
		<session name="loop" type="ts_http" probability="100">
			<for from="1" to="2000000" var="i">
				<transaction name="busyWait">
					<request>
						<http url="/loop.php" version="1.1"/>
					</request>
				</transaction>
				<thinktime value="2" random="true"/>
			</for>
		</session>
	</sessions>
</tsung>